Revit 2027 API
RebarBarType.StirrupTieBendDiameter Property
 Defines bar and hook bend diameter for rebar whose style is stirrup/tie
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double StirrupTieBendDiameter { get; set; }
Public Property StirrupTieBendDiameter As Double
	Get
	Set
public:
property double StirrupTieBendDiameter {
	double get ();
	void set (double value);
}
member StirrupTieBendDiameter : float with get, set
Property Value
Double
 The bar and hook bend diameter for rebar whose style is stirrup/tie
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: the bend diameter stirrupTieBendDiam isn't between bar diameter and 99.0
See Also
Reference
RebarBarType Class
Autodesk.Revit.DB.Structure Namespace